app/controllers/admin/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def list
    @users= User.find(:all)

INSERT INTO `users` (`updated_at`, `password_salt`, `role_id`, `password_hash`, `first_name`, `department_id`, `last_name`, `email`, `created_at`) VALUES('2009-05-18 07:00:00', '357735400.93517980295005', NULL, 'e25c96b5987e72d7518e17840791fecedf0270a5', 'chow', NULL, 'mb', 'bchowdari_nyros@yahoo.com', '2009-05-18 07:00:00')
---
  def create_user
  @departments = Department.find(:all)
  @roles = Role.find(:all)
    if request.post?
    @user = User.new(params[:user])
    @user.created_at = Time.now.to_date