app/controllers/examination_controller.rb

  def index
   user=User.find_by_id(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1