app/controllers/grossing_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def index
    user=User.find_by_id(session[:user_id])