app/controllers/processing_controller.rb

  def index

     user=User.find_by_id(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1

  def create_patient

       if request.post?
         @patient = Patient.new(params[:patient])
         @patient.created_at = Time.now.to_date
---
INSERT INTO `patients` (`social_security`, `updated_at`, `sex`, `date_of_birth`, `first_name`, `middle_initial`, `last_name`, `suffix`, `created_at`) VALUES('sample', '2009-05-19 07:00:00', '0', NULL, 'fdsfdf', 'dsfsdf', 'dsfsdf', 'dsfsdf', '2009-05-19 07:00:00')